In [ ]:
import pandas as pd

df = pd.read_csv("./csv/basic1.csv")
df.head()

In [ ]:
print(df.info())
print(df.shape)

In [ ]:
df_a = df[:50]
df_b = df[50:]

print(df_a.shape)
print(df_b.shape)

In [ ]:
df_a.loc[:, 'f1']= df_a['f1'].fillna(df_a['f1'].median())
df_b.loc[:,'f1'] = df_b['f1'].fillna(df_b['f1'].max())

In [ ]:
df_a['f1'].std()
df_b['f1'].std()

print(round(df_a['f1'].std() + df_b['f1'].std(), 1))

In [ ]:
import pandas as pd

df = pd.read_csv("./csv/basic1.csv")
df.head()

In [ ]:
df = df.sort_values(['f4','f5'], ascending=[False, True]).reset_index(drop=True)
#df

df.iloc[:10,7] = df['f5'][:10].min()
print(round(df['f5'].mean(),2))

In [ ]:
import pandas as pd

df = pd.read_csv('./csv/basic1.csv')
print(df.info())
print(df.head())

In [ ]:
Q1 = df['age'].quantile(0.25)
Q3 = df['age'].quantile(0.75)
IQR = Q3 - Q1 
a = Q1 - 1.5 * IQR
b = Q3 + 1.5 * IQR
print(a, b)

In [ ]:
q1 = df['age'].std() * 1.5
q3 = df['age'].mean()

In [ ]:
import pandas as pd

df = pd.read_csv('./csv/basic1.csv')

print(df.info)

In [ ]:
print(dir(pd))

['ArrowDtype', 'BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt8Dtype', '__all__', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_built_with_meson', '_config', '_is_numpy_dev', '_libs', '_pandas_datetime_CAPI', '_pandas_parser_CAPI', '_testing', '_typing', '_version_meson', 'annotations', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'from_dummies', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'read_xml', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [ ]:
import sklearn

In [ ]:
print(help(sklearn.__all__))

In [ ]:
import pandas as pd 

df = pd.read_csv("./csv/Customer_Data.csv")

print(df.info())
print(df.shape)

In [ ]:
df = pd.read_csv('./csv/basic1.csv')

print(df.info())
print(df.shape)
print(df.isnull().sum())

In [ ]:
import pandas as pd
import numpy as np

df = pd.read_csv("./csv/basic1.csv")
print(df.head())
print(df.shape)

In [ ]:
print(df.isnull().sum()) # f3이 결측치가 80%이상 확인

In [ ]:
print(df.isnull().sum()/df.shape[0])

In [ ]:
print("삭제 전", df.shape)                      # 삭제 전 형태 확인
print("컬럼 목록:", df.columns.tolist())       # 추가: 컬럼 리스트 출력

# 1) errors 옵션 활용
df = df.drop(['f3'], axis=1, errors='ignore')  # errors='ignore' 추가 → 컬럼 없으면 무시

# 2) 조건문 활용 (선택)
# if 'f3' in df.columns:
#     df.drop('f3', axis=1, inplace=True)     # inplace=True 사용 시 df 재할당 불필요

print("삭제 후", df.shape)                      # 삭제 후 형태 확인

In [ ]:
print(df.info())
df.head()

In [ ]:
df['city'].unique()

In [ ]:
s=df[df['city'] == '서울']['f1'].median()
d=df[df['city'] == '경기']['f1'].median()
f=df[df['city'] == '부산']['f1'].median()
g=df[df['city'] == '대구']['f1'].median()

print(s, d, f, g)

In [ ]:
df['f1'] = df['f1'].fillna(df['city'].map({'서울':s, '경기':d, '부산':f, '대구':d}))

print(df['f1'].isnull().sum())

In [18]:
import pandas as pd 

df = pd.read_csv("./csv/basic1.csv")
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [ ]:
a= df[df['f4'] == 'ENFJ']['f1'].std()
b =df[df['f4']=='INFP']['f1'].std()
print(abs(a-b))

In [ ]:
df

In [ ]:
df.isnull().sum()

In [19]:
df = df.dropna(subset=['f1'])

In [ ]:
df = df.drop(['f1','f3'], axis=1)

In [23]:
df2 = df.groupby(['city', 'f2']).sum().reset_index()
df2

,city,f2,id,age,f1,f3,f4,f5
0,경기,0,id69id72id74id75id76id77id80id84id85id88id91id...,720.4,833.0,vip,ESTJESTJESTPESTPENTJINFPISFPINTPINFJESTJINTPIS...,943.944823
1,경기,1,id63id67id70id78id81id83id89id92id95id96,696.0,670.0,vip,ISFJISFJISTPINTJISFJENTPENTJINFPINTJENTJ,657.241212
2,경기,2,id61id64id68id71id98,239.0,311.0,0,INTPESFPISFPISFPINFP,362.300060
3,대구,0,id40id41id43id45id49id53id57,387.0,527.0,0,ENFPENFJISTPENFJINTPESTPISFJ,183.199568
4,대구,1,id47id50id52,217.6,235.0,0,ESTJENFPISFJ,241.333824
5,대구,2,id42id55id58,140.0,211.0,0,ESTPENTPESTP,79.667919
6,부산,0,id24id27id31id32id33id39,331.0,389.0,vip,INFJESTPESFJISFJENFJINFJ,284.371097
7,부산,1,id22id23id26id28id36,188.7,315.0,0,ENFPISTPENFPENTPINTP,299.270973
8,부산,2,id29,-13.5,47.0,0,ENTP,67.886373
9,서울,0,id06id11id13id16,145.0,278.0,vip,INTPENFPESFJESFP,218.528577
10,서울,1,id02id03id07id08id10id14id15id20,315.3,534.0,0,ENFJISTJISFJINFJISFPENTJENTPINTJ,438.485010
11,서울,2,id05id09id18,68.3,207.0,0,ISFJESFJISFJ,126.661135

In [24]:
print(df2.iloc[0]['f1'])

833.0

In [35]:
df = pd.read_csv('./csv/basic1.csv')

In [28]:
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [31]:
d1 = df[df['f4']=='ENFJ']
d1

      id   age city    f1  f2   f3    f4         f5
0   id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1   id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
32  id33  47.0   부산  94.0   0  NaN  ENFJ  17.252986
40  id41  81.0   대구  55.0   0  NaN  ENFJ  37.113739
44  id45  97.0   대구  88.0   0  NaN  ENFJ  13.049921
53  id54  53.0   대구   NaN   1  NaN  ENFJ  69.730313

In [41]:
df['f4'] = df['f4'].replace("ENFJ", "ISFJ")
print(df)

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ISFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ISFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[100 rows x 8 columns]

In [46]:
d1 = df[df['city'] == 4] & df[df['f4']=='ISFJ']
d1.max()

id      False
age     False
city    False
f1      False
f2      False
f3      False
f4      False
f5      False
dtype: bool

수치형 변수 변환하기¶
주어진 데이터에서 'f5'컬럼을 표준화(Standardization (Z-score Normalization))하고 그 중앙값을 구하시오¶

In [2]:
import pandas as pd
df = pd.read_csv("./csv/basic1.csv")

In [3]:
from sklearn.preprocessing import StandardScaler

s = StandardScaler()
df['f5'] = s.fit_transform(df[['f5']])
print(df['f5'].median)

<bound method Series.median of 0     1.220815
1     0.127343
2    -1.394535
3    -0.143667
4    -0.970085
        ...
95   -0.143667
96    0.393896
97    1.472730
98    1.435683
99   -0.827418
Name: f5, Length: 100, dtype: float64>

In [ ]:
import pandas as pd
import numpy as  np
from sklearn.preprocessing import MinMaxScaler

In [21]:
df = pd.read_csv('./csv/basic1.csv')
# df.head(3)
scaler = MinMaxScaler()
df['f5_1'] = scaler.fit_transform(df[['f5']])
# print(df['5_1'])

low = df['f5_1'].quantile(0.05)
high = df['f5_1'].quantile(0.95)

print(np.abs(high + low))

1.0248740983597389